In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("C:/Users/chira/Downloads/Salaries.csv")

In [6]:
df.tail(8)

         rank discipline  phd  service     sex  salary
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [7]:
df['salary'].dtype

dtype('int64')

In [8]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [12]:
df.shape

(78, 6)

In [13]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [14]:
df.size

468

In [15]:
df.ndim

2

In [17]:
df.axes

TypeError: 'list' object is not callable

In [18]:
 df.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [19]:
df.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [20]:
df.iloc[:,:]

         rank discipline  phd  service     sex  salary
0        Prof          B   56       49    Male  186960
1        Prof          A   12        6    Male   93000
2        Prof          A   23       20    Male  110515
3        Prof          A   40       31    Male  131205
4        Prof          B   20       18    Male  104800
..        ...        ...  ...      ...     ...     ...
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

In [21]:
df.iloc[:,1:]

   discipline  phd  service     sex  salary
0           B   56       49    Male  186960
1           A   12        6    Male   93000
2           A   23       20    Male  110515
3           A   40       31    Male  131205
4           B   20       18    Male  104800
..        ...  ...      ...     ...     ...
73          B   18       10  Female  105450
74          B   19        6  Female  104542
75          B   17       17  Female  124312
76          A   28       14  Female  109954
77          A   23       15  Female  109646

[78 rows x 5 columns]

In [49]:
df_rank = df.groupby(['rank'])[['salary','service']].mean()
df_rank

                  salary    service
rank
Prof       123624.804348  21.413043
AssocProf   91786.230769  11.307692
AsstProf    81362.789474   2.210526

In [45]:
df[['salary','rank']]

    salary       rank
0   186960       Prof
1    93000       Prof
2   110515       Prof
3   131205       Prof
4   104800       Prof
..     ...        ...
73  105450       Prof
74  104542  AssocProf
75  124312       Prof
76  109954       Prof
77  109646       Prof

[78 rows x 2 columns]

In [51]:
df.iloc[[0,5], :]

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
5  Prof          A   20       20  Male  122400